Revit 2024 API
MEPNetworkIterator.GetAnalyticalNode Method
 Gets the analytical node at the current iteration step.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2024
Syntax
C#
public MEPAnalyticalNode GetAnalyticalNode()
Visual Basic
Public Function GetAnalyticalNode As MEPAnalyticalNode
Visual C++
public:
MEPAnalyticalNode^ GetAnalyticalNode()
Return Value
 The retrieved node.
See Also
MEPNetworkIterator Class
Autodesk.Revit.DB.Analysis Namespace